Repository: 84000/data-translation-memory
Catalog: toh235-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་སྤྲིན་ཆེན་པོ།
en: The Noble Mahāyāna Sūtra The Great Cloud

source: སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas.

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་། ཉེ་དགའ་བོའི་གནས་ན་ནོར་བུ་རིན་པོ་ཆེ་དཔལ་གྱི་སྙིང་པོའི་སྤྲིན་གྱི་དཀྱིལ་འཁོར་ཆེན་པོའི་ཁང་པ་བརྩེགས་པ་ན་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཆེན་པོ་དང་། ཀླུའི་རྒྱལ་པོའི་ཚོགས་ཆེན་པོ་འདི་ལྟ་སྟེ། ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་། ཉེ་དགའ་དང་། རྒྱ་མཚོ་དང་། མ་དྲོས་པ་དང་། གཟི་ཅན་དང་། ཆུ་ལྷ་དང་། འཇོག་པོ་དང་། ཡུལ་འཁོར་སྲུང་དང་། ནོར་རྒྱས་ཀྱི་བུ་དང་། ཀླུའི་རྒྱལ་པོ་བཏང་བཟུང་དང་། ས་སྲུང་གི་བུ་དང་། མདོངས་བུ་དང་། དཔལ་གྱི་གཟི་བརྗིད་དང་། དཔལ་བཟངས་དང་། གློག་གི་ཕྲེང་བ་དང་།
en: The Bhagavān was at the home of the nāga kings Nanda and Upananda, a lavish palace made of jewels and gems within a great multitude of clouds, together with a great assembly of bhikṣus, a great assembly of bodhisattvas, and a great host of nāga kings.

source: གཙུག་ན་ནོར་བུ་རིན་པོ་ཆེ་དང་། གཙུག་ན་ནོར་བུ་ཐོགས་དང་། སྣང་ལྡན་གཙུག་ཕུད་ཅན་དང་། གཙུག་ཕུད་འཇའ་ཅན་དང་། ཀླུའི་རྒྱལ་པོ་དབང་པོའི་རྒྱལ་མཚན་དང་། དབང་པོའི་མཆོད་སྡོང་དང་། འཛམ་བུའི་རྒྱལ་མཚན་དང་། བཀྲ་ཤིས་ལྡན་དང་། དཀྱིལ་འཁོར་ཆེན་པོ་ཅན་དང་། ལག་གིས་འགྲོ་ཆེན་པོ་དང་། སྐར་མདོག་དང་། ཟླ་བའི་གཟི་བརྗིད་དང་།
en: There were the nāga kings Nanda, Upananda, Sāgara, Anavatapta, Manasvin, Varuṇa, Takṣaka, Dhṛtarāṣṭra, Vāsuki, Mucilinda, Airāvaṇa, Pauṇḍra, Śrītejas, Śrībhadra, Vidyunmālin, Precious Jewel Crest, Cūḍāmaṇidhara, Avabhāsanaśikhin, and Indrāyudhaśikhara.

source: དཔལ་གྱི་བློ་གྲོས་དང་། ཟླ་མཐོང་དང་། ཀླུའི་རྒྱལ་པོ་ལེགས་མཐོང་དང་། ཤིན་ཏུ་བརྟན་དང་། མགུལ་ན་ནོར་བུ་དང་། སྤྲིན་བྱུང་དང་། ཆར་རྒྱུན་དང་། རབ་འཇོམས་དང་། རྣམ་པར་འཇོམས་དང་། མཐུ་བསྒྱིངས་དང་། གདེངས་ཀ་ཆེན་པོ་དང་། དབྱངས་ཟབ་དང་།
en: There were also the nāga kings Indradhvaja, Indrayaṣṭi, Jambudhvaja, Svastika, Mahāmaṇḍalika, Mahābhujaṃga, Jyotīrasa, Śaśitejas, Noble Intelligence, and Somadarśana, and there were the nāga kings Sudarśana, Supratiṣṭhita, Maṇikaṇṭha, Meghasambhava, Varṣadhāra, Prasphoṭaka, Visphoṭaka, Visphūrjita, Mahāphaṇaka, and Gambhīranirghoṣa.

source: ཀླུའི་རྒྱལ་པོ་ཆེར་སྒྲོགས་དང་། རྣམ་པར་སྒྲ་འབྱིན་དང་། ཨུད་པལ་དང་། རྩལ་ཆེན་དང་། གཤོལ་མདའ་འཛིན་དང་། སྣ་ཚོགས་སྡེ་དང་། ཞགས་པ་ཆེན་པོ་དང་།
en: There were also the nāga kings Mahānirnādanādin, Vinardita, Utpalaka, Mahāvikrama, Īṣādhāra, Citrasena, and Mahāpāśa, the nāga king Elāpattra, All Illuminating, Kharakarṇa, Śaṅkha, Dardara, the nāga king Upadardara, Kṣemaṃkara, Bhujaṃgama, Mahābhujaṃgama, Mahābala, Soarer, Apalāla, Lambura, Kṛmiśa, and Kṛṣṇa.

source: ཀླུའི་རྒྱལ་པོ་ཨེ་ལའི་འདབ་མ་དང་། ཀུན་ཏུ་སྣང་དང་། རྣ་རྩུབ་དང་། དུང་དང་། ད་ར་ད་ར་དང་།
en: There were also the nāga kings Indrasena, Naḍa, Upanaḍa, Kambudhāra, Dramiḍa, Sundara, Elephant’s Trunk, Tīkṣṇaka, Piṅgala, Vidyujjvāla, Mahāvidyujjvāla, Baladeva, and Kambala.

source: ཀླུའི་རྒྱལ་པོ་ཨུ་པ་ད་ར་ད་ར་དང་། བདེ་བྱེད་དང་། ལག་འགྲོ་དང་། ལག་འགྲོ་ཆེན་པོ་དང་། དྲི་མ་ཆེན་པོ་དང་། འཕུར་ལྡིང་དང་།
en: There were also the nāga kings Bharukaccha, Amṛta, Tīrthaka, Vaiḍūryaprabha, Suvarṇakeśa, Kanakaprabha, Śaśiketuprabha, Sūryaprabha, Udayana, and Gaveśīrṣa.

source: སོག་མ་མེད་དང་། འཕྱང་བ་དང་། སྲིན་བུ་གནས་དང་། ནག་པོ་དང་། ཀླུའི་རྒྱལ་པོ་དབང་པོ་སྡེ་དང་། འདམ་བུ་དང་། ཉེ་བའི་འདམ་བུ་དང་། དུང་ཐོགས་དང་། འགྲོ་ལྡིང་དང་། རབ་མཛེས་དང་། གླང་ཆེན་སྣ་དང་། རྣོན་པོ་དང་། སེར་སྐྱ་དང་། གློག་འབར་དང་། གློག་འོད་ཆེན་པོ་དང་། སྟོབས་ལྷ་དང་། ཆུ་སྟོབས་དང་། ཀླུའི་རྒྱལ་པོ་དམ་པ་འགེབས་དང་། བདུད་རྩི་ཅན་དང་། མུ་སྟེགས་ཅན་དང་། བཻ་དཱུརྱའི་འོད་ཅན་དང་། གསེར་མདོག་སྒྲ་དང་། གསེར་འོད་དང་། ཟླ་བའི་རྒྱལ་མཚན་འོད་དང་། ཉི་འོད་དང་། འཆར་འོད་དང་། བལ་གླང་མགོ་དང་།
en: There were also the nāga kings Śvetaka, Kālaka, Yama, Śrāmaṇa, Toad, Saṃhatana, Nimindhara, Dharaṇiṃdhara, Sahasraśīrṣa, and Maṇicūḍa.

source: ཀླུའི་རྒྱལ་པོ་དཀར་པོ་དང་། ནག་པོ་དང་། གཤིན་རྗེ་དང་། དགེ་ཚུལ་དང་། སྦལ་པ་དང་། ངང་པའི་གཟི་བརྗིད་དང་། མུ་ཁྱུད་འཛིན་དང་། ས་འཛིན་དང་། མགོ་སྟོང་ཅན་དང་། གཙུག་ན་ནོར་བུ་དང་། ཀླུའི་རྒྱལ་པོ་དོན་ཡོད་མཐོང་དང་། སྤྲིན་ཆེན་དང་། སྡེ་བཟངས་དང་། ས་སྐྱོང་དང་། མིས་བྱིན་དང་། རྣམ་པར་དུལ་དང་། རྒ་བ་འབྱུང་དང་། ཆུ་སྲིན་ཀུན་བྷི་ར་དང་། ཆུ་སྲིན་ཀུན་བྷ་རའི་གདོང་དང་། དུག་འཛིན་དང་།
en: There were also the nāga kings Amoghadarśana, Balāhaka, Suṣeṇa, Gopāla, Naradatta, Vinīta, Jarāyana, Kumbhīra, Kumbhīramukha, and Viṣaṃdhara.

source: ཀླུའི་རྒྱལ་པོ་མྱུར་གདུག་དང་། པད་མ་ཀ་དང་། འཇུག་མ་དང་། རབ་འཕྱང་དང་། འཇིགས་བྱེད་དང་། གཟི་བརྗིད་མཛེས་དང་། མགོ་ལྔ་པ་དང་། བལ་ལི་ར་དང་། ཤིང་རྟས་རྒྱལ་དང་།
en: There were also the nāga kings Āśīviṣa, Padmaka, Lāṅgula, Pralamba, Bhīṣaṇa, Sutejas, Pañcaśīrṣa, Ballira, and Victorious Chariot.

source: ཀླུའི་རྒྱལ་པོ་བླ་མ་དང་། ཀླུའི་རྒྱལ་པོ་མཇུག་རིངས་དང་། མགོ་བོ་ཆེ་དང་། བིམ་པི་ཀ་དང་། བི་ཏ་ར་དང་། མགྱོགས་འགྲོ་དང་། ཀླུའི་རྒྱལ་པོ་མགོ་གསུམ་དང་།
en: There were also the nāga kings Uttaraka, Dīrghapuccha, Sphāraśīrṣa, Bimbika, Vitara, and Aśvaka, the nāga kings Triśīrṣa, Nāgasena, Mahātejas, and Naladatta, and the nāga kings Bhīmaka, Dīptaprabha, Saptaśīrṣa, Bṛhaddruma, Priyadarśana, Mahāpracaṇḍa, Vimalatejas, Sunetra, Mahāghora, and Arciḥskandha.

source: ཀླུ་སྡེ་དང་། གཟི་ཆེན་དང་། འདམ་བུ་བྱིན་དང་། ཀླུའི་རྒྱལ་པོ་སྐྲག་བྱེད་དང་། འོད་འབར་དང་། མགོ་བདུན་པ་དང་། སྡོང་ཆེན་དང་། མཐོང་དགའ་དང་། རབ་ཏུ་ཆེར་གཏུམས་དང་། དྲི་མེད་གཟི་བརྗིད་དང་། མིག་བཟངས་དང་། དྲག་པོ་ཆེན་པོ་དང་། འོད་འཕྲོ་ཕུང་པོ་དང་།
en: There were also the nāga kings Fierce, Ugrakrodha, Ratnāmbuda, Mahāmeghāmbuda, Indraprabha, Pādapa, Meghacandra, Sāgaramegha, Mahāgandhakusuma, and Kumudākara.

source: ཀླུའི་རྒྱལ་པོ་གཏུམ་པོ་དང་། ཁྲོ་བོ་དྲག་ཤུལ་ཅན་དང་། རིན་ཆེན་ཆུ་སྦྱིན་དང་། ཆུ་སྦྱིན་སྤྲིན་ཆེན་དང་། དབང་པོའི་འོད་དང་། རྐང་པས་འཐུང་དང་། སྤྲིན་ཟླ་དང་། རྒྱ་མཚོའི་སྤྲིན་དང་། མེ་ཏོག་དྲི་ཆེན་དང་། ཀུ་མུ་དའི་འབྱུང་གནས་དང་། ཀླུའི་རྒྱལ་པོ་རིན་ཆེན་མིག་དང་། ཏོག་ཆེན་པོའི་རྒྱལ་མཚན་དང་། སྤྲིན་ཆེན་སྙིང་པོ་དང་། ཁ་བ་ཅན་དང་། དཔལ་གྱི་སྙིང་པོ་དང་། སྤྲིན་མཐུ་ཅན་དང་། མཚན་མོ་འཛིན་དང་། ཆུ་སྦྱིན་དང་། ཆུ་སྦྱིན་ཆེན་པོ་དང་།
en: There were also the nāga kings Ratnanetra, Mahāketudhvaja, Mahāmeghagarbha, Himavat, Śrīgarbha, Meghaśaktika, Rajaniṃdhara, Ambuda, and Great Water-Giver and the nāga kings Vaiśvānaratejas, Megheśvararāja, Vigatakrodha, Earth Vase, Nāgaśūra, Jalaṃdhara, Meghacchatra, Aṅgiramukha, Tejasvin, and Meghasphuṭita.

source: ཀླུའི་རྒྱལ་པོ་གཟི་བརྗིད་མེ་འདྲ་དང་། སྤྲིན་གྱི་དབང་ཕྱུག་རྒྱལ་པོ་དང་། ཁྲོ་མེད་དང་། སའི་བུམ་པ་དང་། ཀླུ་དཔའ་དང་། ཆུ་འཛིན་དང་། སྤྲིན་གདུགས་དང་། ཨིང་གི་རའི་གདོང་དང་། གཟི་བརྗིད་ཅན་དང་། སྤྲིན་ལས་མངོན་བྱུང་དང་།
en: There were also the nāga kings Anantakrama, Suṣeṇa, Mahāśarīra, Vṛkodara, Śāntin, Vīra, Kākanāda, Uddhura, Viṣogra, and Sughoṣa.

source: ཀླུའི་རྒྱལ་པོ་གོམ་སྟབས་མཐའ་ཡས་དང་། ཆ་བྱད་མཛེས་དང་། ལུས་ཆེན་དང་། སྤྱང་ལྟོ་དང་། ཞི་བ་དང་། དཔའ་བ་དང་། གསེར་ངད་ཅན་དང་། མཆོག་ཏུ་བརྩོན་དང་། དུག་དྲག་དང་། དབྱངས་སྙན་དང་། ཀླུའི་རྒྱལ་པོ་བདུད་རྩིའི་སྙིང་པོ་དང་། རབ་ཏུ་ཆར་འབེབས་ཆེན་པོ་དང་། རྣམ་པར་གཡོ་དང་། འཁྲུག་སྒྲ་དང་། རྔ་སྒྲ་དང་། བདུད་རྩི་རྒྱུན་དང་། དགའ་བར་བྱེད་པ་དང་། འབྲུག་སྒྲོགས་དང་།
en: There were also the nāga kings Amṛtasāra, Mahāpravarṣaka, Completely Quaking, Saṃghaṭṭaśabda, Dundubhisvara, Amṛtadhāra, Nandika, Garjasphoṭaka, Śūrasena, Nārāyaṇa, and Vaḍabāmukha, and there was the nāga king Deceiver.

source: དཔའ་སྡེ་དང་། སྲེད་མེད་ཀྱི་བུ་དང་། རྒྱ་མཚོའི་གློང་དང་། ཀླུའི་རྒྱལ་པོ་ཡོན་པོ་དང་། ཀླུའི་རྒྱལ་པོ་ཆེན་པོ་དེ་དག་ལ་སོགས་པ་ཀླུ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་དག་འདུས་ཏེ་འཁོད་པ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ།
en: Those and other great nāga kings, altogether eighty-four septillions nāgas, gathered, sat down, and stayed there together.

source: །དེའི་ཚེ་ཀླུའི་རྒྱལ་པོ་དེ་དག་འཁོར་དང་བཅས་ཏེ་སྟན་ལས་ལངས་ནས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བླ་མ་ལ་གུས་པ་དང་། ཕུ་དུད་ཆེན་པོ་བྱེད་པས་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། དར་གྱི་ལྡ་ལྡི་དང་། རོལ་མོའི་སྒྲ་དང་། སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་དང་། གླུ་དབྱངས་དང་།
en: At this point, all those nāga kings, together with their retinues, arose from their seats, draped their robes over one shoulder, knelt with their right knees on the ground, joined their palms, and saluted the Bhagavān.

source: རིན་པོ་ཆེའི་མེ་ཏོག་དང་། རིན་པོ་ཆེའི་ལྡ་ལྡི་དང་། མུ་ཏིག་གི་ཕྲེང་བ་དང་། ཀླུའི་མེ་ཏོག་དང་། མུ་ཏིག་གི་དྲ་བ་མཆོག་ཏུ་མཛེས་པ་རྣམ་པ་སྣ་ཚོགས་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་བཅོམ་ལྡན་འདས་ལ་ཕུལ་ནས་བསྐོར་བ་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: Showing great respect and honor to the teacher, they made offerings to the Bhagavān of various, supremely beautiful flowers, incense, perfumes, garlands, ointments, powders, clothes, parasols, victory banners, banners, silk tassels, music, cymbals, small cymbals, songs, jeweled flowers, jeweled tassels, pearl necklaces, nāga flowers, and supremely beautiful pearl-adorned nets.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་སྨོན་ལམ་རྣམས་བཏབ་པ།
en: They then circumambulated the Bhagavān and stood to one side.

source: ལུས་རྒྱ་མཚོ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱིས་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ཐམས་ཅད་དང་། འཇིག་རྟེན་གྱི་ཁམས་རབ་འབྱམ་རྒྱ་མཚོ་ཐམས་ཅད་དང་། ས་དང་། ཆུ་དང་།
en: Having stood to one side, they made a vow together: “With oceans of bodies as numerous as all the atomic particles in all the oceans of world-systems, we make offerings to all oceans of buddhas and bodhisattvas with their retinues.

source: མེ་དང་། རླུང་ཐམས་ཅད་ཀྱི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་རྣམས་དང་། གཟུགས་སུ་སྣང་བ་ཐམས་ཅད་ཀྱི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་རྣམས་ལས་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་རེ་རེ་ལ་ཡང་ལུས་ཀྱི་སྤྲིན། རྒྱ་མཚོ་བགྲང་བའི་རྒྱ་མཚོ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ་གྲངས་མེད། དཔག་ཏུ་མེད།
en: Within each and every atomic particle of earth, water, fire, and wind and all the atomic particles of apparent forms within all the infinite oceans of world-systems lie oceans of clouds of bodies that are beyond countless, unfathomable, inconceivable, unparalleled, immeasurable, inexpressible, and more numerous than all numerable oceans.

source: བསམ་གྱིས་མི་ཁྱབ་མཚུངས་པ་མེད། གཞལ་དུ་མེད། བརྗོད་དུ་མེད་པ་ལས་ཡང་དག་པར་འདས་པ་དག་དང་། ལུས་རེ་རེ་ལ་ཡང་ལག་པ་རྒྱ་མཚོའི་སྤྲིན་ཕྱོགས་ཀུན་གྱི་རྒྱུན་དུ་མངོན་པར་ཕྱོགས་པ་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་བྱིན་གྱིས་བརླབས་ནས། རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་གྱི་ཆ་རེ་རེ་ལས་ཀྱང་མཆོད་པ་ཐམས་ཅད་ཀྱི་སྤྲིན་རྒྱ་མཚོ་ཕྱོགས་ཀུན་གྱི་གཞི་རྒྱས་པར་འགེངས་པ།
en: Upon each and every one of these bodies are emanated immeasurable, countless oceans of clouds of hands, from which are emanated oceans of clouds of all manner of offerings, distinct and radiating continuously in all directions.

source: མ་འདྲེས་པ་རྣམས་ཀྱིས་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་མཆོད་པ་བྱའོ་སྙམ་པ་འདི་ལྟ་སྟེ། ཀུན་དུ་སྤྱོད་པའི་ལུས་རྒྱ་མཚོ་སྤྲིན་མ་འདྲེས་པ་དཔག་ཏུ་མེད། གྲངས་མེད། བསམ་གྱིས་མི་ཁྱབ། གཞལ་དུ་མེད། ཚད་མེད། བརྗོད་དུ་མེད་པ་དག་གིས་ནམ་མཁའི་དཀྱིལ་ཀུན་དུ་ཁེབས་པར་བྱིན་གྱིས་བརླབས་ནས་བྱང་ཆུབ་སེམས་དཔའི་ལུས་རྒྱ་མཚོ་སྤྲིན་རྣམས་ཀྱིས་ཇི་ལྟ་བ་དེ་བཞིན་དུ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཁ་དོག་དང་། འོད་ཟེར་སྟུག་པོ་དང་།
en: With these, we will make offerings to all buddhas and bodhisattvas.”

source: ཉི་མ་དང་། ཟླ་བ་ཐམས་ཅད་ལྟ་བུའི་ལུས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཕྲེང་བ་དང་། མེ་ཏོག་གི་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་སྣང་བ་ཆེན་པོའི་སྙིང་པོའི་ཁང་པ་བརྩེགས་པ་རྒྱ་མཚོའི་སྤྲིན་རྣམས་དང་། ཕྱེ་མ་དང་། ཤིང་ལྗོན་པ་ཐམས་ཅད་ཀྱི་མཛོད་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། སྤོས་དང་། བདུག་པ་ཐམས་ཅད་ཀྱི་གཟུགས་ཀུན་དུ་སྟོན་པ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། སྒྲ་ཐམས་ཅད་སྒྲོགས་པའི་རོལ་མོའི་སྒྲ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་།
en: Thinking thus, they continued: “We will fill the sky with unfathomable, countless, inconceivable, immeasurable, incalculable, inexpressible, distinct emanations of bodies engaging in the perfect conduct of Samantabhadra, with oceans of clouds of bodhisattva bodies, and likewise with a multitude of oceans of clouds of all manner of jewels, densely arrayed rays of light, and bodies of all suns and moons, together with oceans of clouds of jeweled garlands and flowers; oceans of clouds of great mansions made from the essence of all brilliant jewels; oceans of clouds of storehouses of all manner of powders and trees; oceans of clouds of incenses, perfumes, and all manner of apparent forms; oceans of clouds of the sounds of instruments resounding with all manner of music; and oceans of clouds of all manner of trees used for incense.

source: སྤོས་ཐམས་ཅད་ཀྱི་ཤིང་ལྗོན་པ་རྒྱ་མཚོ་སྤྲིན་རྣམས་ཀྱིས་ནམ་མཁའི་དཀྱིལ་ཀུན་དུ་ཁེབས་པར་བྱིན་གྱིས་བརླབས་ནས་དེ་ལ་སོགས་པ་མཆོད་པ་ཐམས་ཅད་ཀྱི་སྤྲིན་རྒྱ་མཚོ་དཔག་ཏུ་མེད། གྲངས་མེད། བསམ་གྱིས་མི་ཁྱབ། གཞལ་དུ་མེད། ཚད་མེད།
en: We will fill the sky with these emanations, with oceans of cloud of all manner of offerings that are unfathomable, countless, inconceivable, immeasurable, incalculable, inexpressible, and distinct.

source: བརྗོད་དུ་མེད་པ། མ་འདྲེས་པ་རྣམས་ཀྱིས། སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་བསྟི་སྟང་དུ་བྱའོ།
en: Having done all this, we will proceed to pay homage to all the oceans of buddhas and bodhisattvas.

source: །བླ་མར་བྱའོ། །རི་མོར་བྱའོ། །མཆོད་པར་བྱའོ།
en: We will exalt them, honor them, and make offerings to them. “

source: །ཡུལ་ཐམས་ཅད་དུ་བཀོད་པ་རྣམ་པར་སྣང་བར་བྱས་པའི་སྙིང་པོ་ཅན་གྱི་ནོར་བུའི་རྒྱལ་པོ་རྒྱ་མཚོ་སྤྲིན་རྣམས་ཀྱིས་ནམ་མཁའི་དཀྱིལ་ཀུན་དུ་ཁེབས་པར་བྱིན་གྱིས་བརླབས་ཏེ།
en: We will fill the sky with emanations of oceans of clouds of kings of jewels within which all the arrayed realms of existence are illuminated.

source: སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་བསྟི་སྟང་དུ་བྱའོ།
en: Having done so, we will pay homage to all the oceans of buddhas and bodhisattvas.

source: །བླ་མར་བྱའོ། །རི་མོར་བྱའོ། །མཆོད་པར་བྱའོ། །ཐམས་ཅད་ཀུན་དུ་སྣང་བའི་རིན་པོ་ཆེའི་ཆར་འབབ་པ་བཀོད་པའི་ནོར་བུའི་རྒྱལ་པོ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་འོད་འཕྲོ་བ་འབར་བ་དང་ལྡན་པ་སངས་རྒྱས་ལ་ངེས་པར་གྱུར་པའི་དབྱངས་ཀྱི་ནོར་བུའི་རྒྱལ་པོ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། ཀུན་དུ་སྒྲས་འགེངས་པ་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་དབྱངས་ཅན་ནོར་བུའི་རྒྱལ་པོ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་།
en: We will exalt them, honor them, and make offerings to them. “

source: ཀུན་ནས་སྒོ་རིན་པོ་ཆེ་འོད་ཟེར་གྱིས་སངས་རྒྱས་ཀྱི་སྤྲུལ་པ་སྣང་བར་བྱེད་པ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། འཁོར་གྱི་དཀྱིལ་འཁོར་མ་འདྲེས་པ་རྣམས་སུ་བཀོད་པ་ཐམས་ཅད་སྣང་བ་ཀུན་དུ་སྟོན་པའི་ནོར་བུའི་རྒྱལ་པོ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། འོད་འཕྲོ་བ་སྒྲོན་མ་སངས་རྒྱས་ཀྱི་ཡུལ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འཇུག་པའི་ནོར་བུའི་རྒྱལ་པོ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཞིང་བསམ་གྱིས་མི་ཁྱབ་པ་རྣམས་སུ་དེ་བཞིན་གཤེགས་པའི་གཞལ་མེད་ཁང་སྣང་བ་ཀུན་དུ་སྟོན་པའི་ནོར་བུའི་རྒྱལ་པོ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་ཐམས་ཅད་ཀྱི་རྡུལ་ལ་དུས་གསུམ་གྱི་སངས་རྒྱས་ཀྱི་སྐུ་སྣང་བ་རྣམ་པར་སྣང་བར་བྱེད་པའི་ནོར་བུའི་རྒྱལ་པོ་རྒྱ་མཚོ་སྤྲིན་རྣམས་ཀྱིས་ནམ་མཁའི་དཀྱིལ་ཀུན་དུ་ཁེབས་པར་བྱིན་གྱིས་བརླབས་ཏེ།
en: We will fill the sky with emanations of oceans of clouds of arrayed kings of jewels that shower down a rain of all-illuminating gemstones; oceans of clouds of kings of jewels blazing with the light of all gemstones, resounding with the melodic sounds of the attainment of buddhahood; oceans of clouds of kings of jewels filling everywhere with the universal resounding of the melodies of all the Dharma teachings of the buddhas; oceans of clouds of emanated buddha bodies illuminated by jeweled light radiating from all directions; oceans of clouds of kings of jewels that display the appearance of all the arrays of distinct retinues; oceans of clouds of kings of jewels whose brilliant lamp-like rays of light enter into all buddha realms; oceans of clouds of kings of jewels that display the appearances of all the immeasurable palaces of the tathāgatas in all the inconceivable buddhafields; and oceans of clouds of kings of jewels that illuminate the display of the bodies of the buddhas of the three times within the atomic particles of all variety of gemstones.

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་རྒྱ་མཚོ་སྤྲིན་ཐམས་ཅད་ལ་བསྟི་སྟང་དུ་བྱའོ། །བླ་མར་བྱའོ།
en: With these, we will pay homage to all the oceans of buddhas and bodhisattvas.

source: །རི་མོར་བྱའོ། །མཆོད་པར་བྱའོ། །རིན་པོ་ཆེ་དང་། སྤོས་དང་། མེ་ཏོག་སྣ་ཚོགས་ཐམས་ཅད་ཀྱི་ཁང་པ་བརྩེགས་པ་མ་འདྲེས་པ་རྒྱ་མཚོའི་སྤྲིན་རྣམས་དང་།
en: We will exalt them, honor them, and make offerings to them. “

source: ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཁ་དོག་མཐའ་ཡས་པ་ཐམས་ཅད་ཀྱིས་རབ་ཏུ་བརྒྱན་པའི་ཁང་པ་བརྩེགས་པ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེའི་སྒྲོན་མ་དང་། སྤོས་ཀྱི་འོད་འཕྲོ་བ་ཅན་གྱི་ཁང་པ་བརྩེགས་པ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། མུ་ཏིག་ཐམས་ཅད་ཀྱིས་རྣམ་པར་སྤྲས་པའི་ཁང་པ་བརྩེགས་པ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། མེ་ཏོག་ཐམས་ཅད་ཀྱི་ཟེ་བ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེའི་ཕྲེང་བ་མཐའ་ཡས་པས་ལེགས་པར་བརྒྱན་པའི་ཁང་པ་བརྩེགས་པའི་རྒྱ་མཚོ་སྤྲིན་རྣམས་ཀྱིས་ནམ་མཁའི་དཀྱིལ་ཀུན་དུ་ཁེབས་པར་བྱིན་གྱིས་བརླབས་ནས།
en: We will fill the sky with emanations of oceans of clouds of distinct multistoried palaces of sundry jewels, incense, and flowers; oceans of clouds of multistoried palaces completely adorned with kings of jewels of an infinite variety of colors; oceans of clouds of multistoried palaces with jeweled lamps and radiant incense; oceans of clouds of multistoried palaces thoroughly bedecked with all manner of pearls; oceans of clouds of the anthers of all manner of flowers; and oceans of clouds of multistoried palaces beautifully adorned with infinite jewel garlands.

source: ཕྱོགས་བཅུ་ཀུན་དུ་འོད་ཟེར་སྣང་བའི་སྙིང་པོ་ཅན། བཀོད་པ་ཐམས་ཅད་ཡང་དག་པར་འདུ་བའི་ཁང་པ་བརྩེགས་པ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་རྡུལ་ཕྲ་རབ་ཀྱིས་རབ་ཏུ་བརྒྱན་པ་བཀོད་པ་དུ་མ་ཀུན་དུ་སྟོན་པའི་ཁང་པ་བརྩེགས་པ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། བཀོད་པ་ཐམས་ཅད་ཀྱིས་རབ་ཏུ་བརྒྱན་པ་ཀུན་དུ་རྒྱས་པར་འགེངས་པའི་ཁང་པ་བརྩེགས་པ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། སྒོ་ཀུན་དུ་མེ་ཏོག་གི་རྟ་བབས་དྲིལ་བུའི་དྲ་བ་དཔྱངས་པ་རྒྱ་མཚོ་སྤྲིན་རྣམས་ཀྱིས་ནམ་མཁའི་དཀྱིལ་ཀུན་དུ་ཁེབས་པར་བྱིན་གྱིས་བརླབས་ཏེ།
en: We will then fill the sky with emanations of oceans of clouds of multistoried palaces that completely contain an adornment of all essences whose brilliance illuminates the ten directions; oceans of clouds of multistoried palaces that appear completely ornamented everywhere with adornments of fine particles of all manner of jewels; oceans of clouds of multistoried palaces overflowing with adornments of all manner of decorations; and oceans of clouds of multistoried palaces with flowered arches at each doorway hung with lattices of bells.

source: །བླ་མར་བྱའོ། །རི་མོར་བྱའོ། །མཆོད་པར་བྱའོ། །གསེར་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཙོང་ཙོང་དང་། ཕྲེང་བ་དང་། རིན་པོ་ཆེའི་མགུལ་གདུབ་ཀྱི་སྙིང་པོ་ཅན་གྱི་སེང་གེའི་ཁྲི་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། མེ་ཏོག་ལྟར་སྣང་བ་སྣ་ཚོགས་ཀྱི་སྙིང་པོ་ཅན་གྱི་སེང་གེའི་ཁྲི་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་།
en: We will exalt them, honor them, and make offerings to them. “

source: ཨན་ད་རྙིལ་དང་། འཛམ་བུའི་ཆུ་བོའི་གསེར་གྱི་པད་མ་སྣ་ཚོགས་ཀྱི་སྙིང་པོ་ཅན་གྱི་སེང་གེའི་ཁྲི་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། ནོར་བུ་རིན་པོ་ཆེའི་སྒྲོན་མའི་པད་མའི་སྙིང་པོ་ཅན་གྱི་སེང་གེའི་ཁྲི་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་ནོར་བུ་རིན་པོ་ཆེ་སྣང་གསལ་རྒྱལ་མཚན་གྱི་པད་མ་སྣ་ཚོགས་ཀྱི་སྙིང་པོ་ཅན་གྱི་སེང་གེའི་ཁྲི་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེས་བརྒྱན་པ་པད་མ་སྣ་ཚོགས་ཀྱི་སྙིང་པོ་ཅན་གྱི་སེང་གེའི་ཁྲི་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། ཨན་ད་རྙིལ་མཛེས་པར་འབར་བའི་འོད་ཟེར་ལྡན་པའི་པད་མའི་སྙིང་པོ་ཅན་གྱི་སེང་གེའི་ཁྲི་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། འོད་ཟེར་འབར་བ་ཟད་མི་ཤེས་པའི་གཟི་བརྗིད་དང་ལྡན་པའི་པད་མའི་སྙིང་པོ་ཅན་གྱི་སེང་གེའི་ཁྲི་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེ་འབར་བ་ཐམས་ཅད་བྱུང་བའི་པད་མའི་སྙིང་པོ་ཅན་གྱི་སེང་གེའི་ཁྲི་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེ་འབར་བ་མཆོག་དམ་པ་ཐམས་ཅད་བྱུང་བའི་པད་མའི་སྙིང་པོ་ཅན་གྱི་སེང་གེའི་ཁྲི་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། སངས་རྒྱས་ཀྱི་གསུང་སྒྲའི་འོད་ཟེར་དང་ལྡན་པའི་པད་མའི་སྙིང་པོ་ཅན་གྱི་སེང་གེའི་ཁྲི་རྒྱ་མཚོ་སྤྲིན་མ་འདྲེས་པ་རྣམས་ཀྱིས་ནམ་མཁའི་དཀྱིལ་ཀུན་དུ་ཁེབས་པར་བྱིན་གྱིས་བརླབས་ཏེ།
en: We will fill the sky with emanations of oceans of clouds of lion thrones containing necklaces of gold and various jewels and jeweled chokers; oceans of clouds of lion thrones containing various brilliant flowers; oceans of clouds of lion thrones containing various lotus flowers with the blue color of the indranīla jewel and the golden hue of the Jambu River; oceans of clouds of lion thrones containing precious jeweled lotus lamps; oceans of clouds of lion thrones containing brilliantly bejeweled lotus victory banners; oceans of clouds of lion thrones containing various lotus flowers adorned with jewels; oceans of clouds of lion thrones containing lotus flowers decorated with indranīla jewels and blazing with golden light; oceans of clouds of lion thrones containing lotus flowers endowed with inexhaustibly brilliant blazing light; oceans of clouds of lion thrones containing lotus flowers that produce all manner of blazing jewels; oceans of clouds of lion thrones containing lotus flowers that produce all manner of supremely sublime blazing jewels; and distinct oceans of clouds of lion thrones containing lotus flowers endowed with the light rays of the sound of the Buddha’s speech.

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་བསྟི་སྟང་དུ་བྱའོ།
en: With these, we will pay homage to all the oceans of buddhas and bodhisattvas.

source: །བླ་མར་བྱའོ། །རི་མོར་བྱའོ། །མཆོད་པར་བྱའོ། །སྤོས་དང་། ནོར་བུ་སྣ་ཚོགས་ཐམས་ཅད་ཀྱི་ཤིང་ལྗོན་པ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། ཀུན་ནས་སྒོ་ལོ་མ་ལས་ཐལ་མོ་སྦྱར་བའི་སྤྲིན་འབྱུང་བའི་སྤོས་ཀྱི་ཤིང་ལྗོན་པ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། ཤིང་ལྗོན་པ་ཐམས་ཅད་ཀྱི་གཟུགས་མཐའ་ཡས་པ་བཀོད་པ་ཀུན་དུ་སྟོན་པའི་ཤིང་ལྗོན་པ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། མེ་ཏོག་ཐམས་ཅད་ཀྱི་སྤྲིན་རབ་ཏུ་འཕྱང་བའི་སྤྲིན་ཤིང་ལྗོན་པ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་།
en: We will exalt them, honor them, and make offerings to them. “

source: བཀོད་པ་ཐམས་ཅད་འབྱུང་བའི་མཛོད་མཐའ་ཡས་པ་དང་ལྡན་པའི་ཤིང་ལྗོན་པ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེ་འོད་འཕྲོ་བ་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་སྣང་བར་བྱེད་པའི་ཤིང་ལྗོན་པ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཕྱེད་ཙན་དན་ཐམས་ཅད་ཀྱི་ཕྱེ་མར་ཀུན་དུ་སྟོན་པའི་ཤིང་ལྗོན་པ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ཐམས་ཅད་ཀྱི་བཀོད་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་འོད་ཅན་གྱི་ཤིང་ལྗོན་པའི་རིན་པོ་ཆེའི་གོས་ཐམས་ཅད་ཀྱི་མཛོད་ཉི་མ་ལྟར་སྣང་བར་བྱས་པ་དང་ལྡན་པའི་ཤིང་ལྗོན་པ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། སྒྲ་དབྱངས་ཐམས་ཅད་སྒྲོགས་པ་ཡིད་དུ་འོང་བའི་དབྱངས་ཀུན་དུ་གཏོང་བའི་ཤིང་ལྗོན་པ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེ་ཁ་དོག་མཐའ་ཡས་པའི་པད་མའི་སྙིང་པོ་ཅན་གྱི་སེང་གེའི་ཁྲི་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་།
en: We will fill the sky with emanations of oceans of clouds of trees festooned with all manner of gemstones; oceans of clouds of incense trees wreathed all over with leaves that emanate clouds of joined palms; oceans of clouds of trees that appear as an infinite array of all forms of trees; oceans of clouds of trees draped with clouds of all manner of flowers; oceans of clouds of trees endowed with infinite troves that produce all manner of adornments; oceans of clouds of trees completely illuminated by multitudes of all radiant jewels; oceans of clouds of trees that manifest busts of bodhisattva bodies made from all manner of sandalwood powders; oceans of clouds of trees endowed with the brilliant solar light of the storehouse of all manner of precious clothing of the infinite tree spirits adorning all seats of awakening with inconceivable brilliant light; and oceans of clouds of trees emitting pleasing tones that resound with all manner of melodies. “
